httperf/output_new_1_0.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=35.93.153.9 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile_new_1_0.txt --port=80 --uri=/ --period=e0.1 --send-buffer=4096 --recv-buffer=16384 --wsesslog=360,0.000,input.txt


 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 



 here 

Maximum connect burst length: 2

Total: connections 360 requests 0 replies 0 test-duration 32.675 s

Connection rate: 11.0 conn/s (90.8 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 0.0 avg 0.0 max 0.0 median 0.0 stddev 0.0
Connection time [ms]: connect 0.6
Connection length [replies/conn]: 0.000

Request rate: 0.0 req/s (0.0 ms/req)
Request size [B]: 0.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (6 samples)
Reply time [ms]: response 0.0 transfer 0.0
Reply size [B]: header 0.0 content 0.0 footer 0.0 (total 0.0)
Reply status: 1xx=0 2xx=0 3xx=0 4xx=0 5xx=0

CPU time [s]: user 31.69 system 0.78 (user 97.0% system 2.4% total 99.4%)
Net I/O: 0.0 KB/s (0.0*10^6 bps)

Errors: total 360 client-timo 0 socket-timo 0 connrefused 360 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 0 
Session rate [sess/s]: min 0.00 avg 0.00 max 0.00 stddev 0.00 (0/360)
Session: avg 0.00 connections/session
Session lifetime [s]: 0.0
Session failtime [s]: 0.0
Session length histogram: 360